# AddOverride Method

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RebarContainerParameterManager..::..AddOverride Method
RebarContainerParameterManager Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AddOverride(ElementId, ElementId) | Adds an override for the given parameter as its value will be displayed for the Rebar Container element. |
| AddOverride(ElementId, Double) | Adds an override for the given parameter as its value will be displayed for the Rebar Container element. |
| AddOverride(ElementId, Int32) | Adds an override for the given parameter as its value will be displayed for the Rebar Container element. |
| AddOverride(ElementId, String) | Adds an override for the given parameter as its value will be displayed for the Rebar Container element. |

# See Also
RebarContainerParameterManager Class
RebarContainerParameterManager Members
Autodesk.Revit.DB.Structure Namespace